In [1]:
import numpy as np
import pandas as pd

In [2]:
# Input and Output (CSV Files)

In [3]:
# veri tipleri formatlari okunabilirlilik ve yazilabilirlilik tablosu kurs kaynaklari icerisinde linkte var bakilabilir.

In [5]:
pwd # nerede calisiyorum konum olarak?

'/Users/komalperen/Desktop/Praktikum/Python for ML and DS - Udemy Course/Pandas'

In [7]:
import os  # operating sytem modulüdür. terminal komutlari rahatlikla kullanilir.

In [9]:
os.getcwd() # jupyter de calisilmiyorsa python icerisinde bu kütüphane sayesinde calisma lokasyonu bulunabilir.

'/Users/komalperen/Desktop/Praktikum/Python for ML and DS - Udemy Course/Pandas'

In [16]:
df = pd.read_csv('example.csv')  # dosyanin pandasin yazildigi dööküman ile ayni konumda olmasi acilmasi icin yeterldiir.

In [17]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [18]:
pd.read_csv('example.csv', header=None) # baslik kismi satirlara gecer.

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [19]:
# bir dosyanin pandas ile okunup acilmasi icin : df.to_csv('') ve pd.read_csv('') 
# komutlarinin ikisi de kullanilabilir. Parantez iclerine dosyalarin isimler yazilir

In [20]:
# HTML Tables

In [21]:
# pandas html tablolarini otomatik olarak pandas DataFrame olarak dönüstürüp okuyabilir.

In [38]:
url = "https://en.wikipedia.org/wiki/World_population"

In [39]:
tables = pd.read_html(url)

In [40]:
len(tables) # web sayfasinda cmd + f ile <table yazdigimizda 30 tane tablo tag i oldugunu görebiliyoruz.

30

In [41]:
tables[0]

,Population,1,2,3,4,5,6,7,8,9,10
0,Year,1804,1927,1960,1974,1987,1999,2011,2022,2037,2057
1,Years elapsed,"200,000+",123,33,14,13,12,12,11,15,20

In [42]:
tables[1]

,Region,2022 (percent),2030 (percent),2050 (percent)
0,Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
1,Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
2,Central Asia and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
3,Eastern Asia and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
4,Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
5,Latin America and the Caribbean,658 (8.29%),695 (8.17%),749 (7.73%)
6,Australia and New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
7,Oceania,14 (0.18%),15 (0.18%),20 (0.21%)
8,World,7942,8512,9687

In [43]:
tables[1].columns

Index(['Region', '2022 (percent)', '2030 (percent)', '2050 (percent)'], dtype='object')

In [44]:
table1 = tables[1]

In [45]:
table1

,Region,2022 (percent),2030 (percent),2050 (percent)
0,Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
1,Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
2,Central Asia and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
3,Eastern Asia and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
4,Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
5,Latin America and the Caribbean,658 (8.29%),695 (8.17%),749 (7.73%)
6,Australia and New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
7,Oceania,14 (0.18%),15 (0.18%),20 (0.21%)
8,World,7942,8512,9687

In [46]:
table1 = table1.drop(5) # 5. satiri dopladik. Bu satir bir kere daha calistirilirsa hata verir. Cünkü coktan 5. satir cikartildi.

In [47]:
table1

,Region,2022 (percent),2030 (percent),2050 (percent)
0,Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
1,Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
2,Central Asia and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
3,Eastern Asia and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
4,Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
6,Australia and New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
7,Oceania,14 (0.18%),15 (0.18%),20 (0.21%)
8,World,7942,8512,9687

In [49]:
table1.to_html('sample_table.html', index = False)   # Yeni bir html formatinda dosya olusturulamasini saglar. 
#index=False ifadesi, tablonun HTML dosyasına yazılırken indeks sütununun dahil edilmemesini sağlar. 
# Yani, tablonun veri çerçevesindeki satır numaraları veya indeks bilgileri HTML dosyasına yazılmayacaktır; 
# sadece tablonun veri sütunları ve içerikleri yer alacaktır.

In [50]:
## Excel Files :

In [51]:
df = pd.read_excel('my_excel_file.xlsx')

In [52]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [55]:
df = pd.read_excel('my_excel_file.xlsx', sheet_name='First_Sheet')
# sheet_name='First_Sheet', my_excel_file.xlsx dosyasındaki "First_Sheet" adlı sayfayı okumak istediğinizi belirtir.

In [56]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [57]:
wb = pd.ExcelFile('my_excel_file.xlsx')

In [58]:
wb.sheet_names

['First_Sheet']

In [60]:
excel_sheet_dict = pd.read_excel('my_excel_file.xlsx', sheet_name=None)

In [61]:
type(excel_sheet_dict)

dict

In [62]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [63]:
excel_sheet_dict['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [65]:
excel_sheet_dict # First_Sheet key karsisi ise value dür.

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [68]:
our_df = excel_sheet_dict['First_Sheet']

In [69]:
our_df.to_excel('example.xlsx', sheet_name = 'First_Sheet', index = False)

In [71]:
## SQL Databases

In [74]:
# pandas sql ile kombine calisabilir ve sql verilerini isleyebilir.
# sql cesitleri vardir : MySQL, MicrosoftSQL, PostgreSQL...

In [75]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/komalperen/Desktop/anaconda3/lib/python3.11/site-packages (2.0.25)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/komalperen/Desktop/anaconda3/lib/python3.11/site-packages (from sqlalchemy) (4.9.0)
Note: you may need to restart the kernel to use updated packages.

In [76]:
from sqlalchemy import create_engine

In [86]:
temp_db = create_engine('sqlite:///:memory')

In [87]:
df = pd.DataFrame(data = np.random.randint(low = 0, high = 100, size = (4,4)), columns = ['a', 'b', 'c', 'd'])

In [88]:
df

    a   b   c   d
0  39  76  98  42
1  16  13  51   9
2  15  63  81  82
3  28  75  77  52

In [90]:
df.to_sql(name = 'new_table1', con = temp_db) 
# con, veri çerçevesinin SQL veritabanına yazılması için kullanılan veritabanı bağlantısını ifade eder.

4

In [91]:
new_df = pd.read_sql(sql='new_table1', con = temp_db)

In [92]:
new_df

   index   a   b   c   d
0      0  39  76  98  42
1      1  16  13  51   9
2      2  15  63  81  82
3      3  28  75  77  52

In [93]:
new_df.columns

Index(['index', 'a', 'b', 'c', 'd'], dtype='object')

In [96]:
result = pd.read_sql_query(sql='SELECT A,C FROM new_table1', con=temp_db)

In [97]:
result

    a   c
0  39  98
1  16  51
2  15  81
3  28  77

In [98]:
# Pivot Tables

In [99]:
# Pandas'ta pivot tabloları, verilerin özetlenmesi ve yeniden şekillendirilmesi için kullanılan, 
# belirli bir değişkene göre gruplandırılmış ve özetlenmiş bir veri yapısıdır. 
# Pivot tablolar, büyük veri setlerinde özet istatistikler oluşturmak ve verileri analiz etmek için kullanılır.

In [100]:
# Tekrar eden sütun degerlerinde cok veri olabilir ve bu kafa karistirabilir. Bu tip durumlarda index kisimlarinda sütunlar kullanilir
# ve sütun isimlendirmesinde tekrar eden (genellikle diskret Deger) veriler yerlestirilir.

In [123]:
df = pd.read_csv('Sales_Funnel_CRM.csv')

In [124]:
df

,Account Number,Company,Contact,Account Manager,Product,Licenses,Sale Price,Status
0,2123398,Google,Larry Pager,Edward Thorp,Analytics,150,2100000,Presented
1,2123398,Google,Larry Pager,Edward Thorp,Prediction,150,700000,Presented
2,2123398,Google,Larry Pager,Edward Thorp,Tracking,300,350000,Under Review
3,2192650,BOBO,Larry Pager,Edward Thorp,Analytics,150,2450000,Lost
4,420496,IKEA,Elon Tusk,Edward Thorp,Analytics,300,4550000,Won
5,636685,Tesla Inc.,Elon Tusk,Edward Thorp,Analytics,300,2800000,Under Review
6,636685,Tesla Inc.,Elon Tusk,Edward Thorp,Prediction,150,700000,Presented
7,1216870,Microsoft,Will Grates,Edward Thorp,Tracking,300,350000,Under Review
8,2200450,Walmart,Will Grates,Edward Thorp,Analytics,150,2450000,Lost
9,405886,Apple,Cindy Phoner,Claude Shannon,Analytics,300,4550000,Won
10,470248,Exxon Mobile,Cindy Phoner,Claude Shannon,Analytics,150,2100000,Presented
11,698032,ATT,Cindy Phoner,Claude Shannon,Tracking,150,350000,Under Review
12,698032,ATT,Cindy Phoner,Claude Shannon,Prediction,150,700000,Presented
13,902797,CVS Health,Emma Gordian,Claude Shannon,Tracking,450,490000,Won
14,2046943,Salesforce,Emma Gordian,Claude Shannon,Analytics,750,7000000,Won
15,2169499,Cisco,Emma Gordian,Claude Shannon,Analytics,300,4550000,Lost
16,2169499,Cisco,Emma Gordian,Claude Shannon,GPS Positioning,300,350000,Presented

In [105]:
#help(pd.pivot)

In [125]:
licenses = df[['Company', 'Product', 'Licenses']]

In [126]:
licenses

         Company          Product  Licenses
0         Google        Analytics       150
1         Google       Prediction       150
2         Google         Tracking       300
3           BOBO        Analytics       150
4           IKEA        Analytics       300
5     Tesla Inc.        Analytics       300
6     Tesla Inc.       Prediction       150
7      Microsoft         Tracking       300
8        Walmart        Analytics       150
9          Apple        Analytics       300
10  Exxon Mobile        Analytics       150
11           ATT         Tracking       150
12           ATT       Prediction       150
13    CVS Health         Tracking       450
14    Salesforce        Analytics       750
15         Cisco        Analytics       300
16         Cisco  GPS Positioning       300

In [132]:
licenses.columns

Index(['Company', 'Product', 'Licenses'], dtype='object')

In [136]:
pd.pivot_table(data = licenses , index = 'Company', columns = 'Product', values='Licenses')  # yukaridaki grafigi inceleyerek yorumla.

Product       Analytics  GPS Positioning  Prediction  Tracking
Company
 Google           150.0              NaN       150.0     300.0
ATT                 NaN              NaN       150.0     150.0
Apple             300.0              NaN         NaN       NaN
BOBO              150.0              NaN         NaN       NaN
CVS Health          NaN              NaN         NaN     450.0
Cisco             300.0            300.0         NaN       NaN
Exxon Mobile      150.0              NaN         NaN       NaN
IKEA              300.0              NaN         NaN       NaN
Microsoft           NaN              NaN         NaN     300.0
Salesforce        750.0              NaN         NaN       NaN
Tesla Inc.        300.0              NaN       150.0       NaN
Walmart           150.0              NaN         NaN       NaN

In [139]:
pd.pivot_table(df, index='Company', aggfunc='sum', values=df.select_dtypes(include='number').columns) 
# sadece numeric verilerde sum fonksiyonunu kullanmak icin böyle bir koda yazmamiz gerekiyor.

              Account Number  Licenses  Sale Price
Company
 Google              6370194       600     3150000
ATT                  1396064       300     1050000
Apple                 405886       300     4550000
BOBO                 2192650       150     2450000
CVS Health            902797       450      490000
Cisco                4338998       600     4900000
Exxon Mobile          470248       150     2100000
IKEA                  420496       300     4550000
Microsoft            1216870       300      350000
Salesforce           2046943       750     7000000
Tesla Inc.           1273370       450     3500000
Walmart              2200450       150     2450000